testAme/labs/lab4/buoyantCase/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState Boussinesq;
    specie          specie;
    energy          sensibleInternalEnergy;
}

dpdt	yes;

mixture
{
    specie
    {
        molWeight   	28.9;
    }
    equationOfState
    {
    	beta		3.4e-3;
	T0		300;
	rho0		1;	
    }
    thermodynamics
    {
	Cv          	712;
        Hf          	0;
    }
    transport
    {
        mu          	1.8e-05;
        Pr          	0.7;
	Prt		0.85;
    }
}


// ************************************************************************* //
